Revit 2020 API
DirectShape.IsValidCategoryId Method
 Test the category id to make sure it is indeed a top-level built-in category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2015
Syntax
C#
public static bool IsValidCategoryId(
	ElementId categoryId,
	Document doc
)
Visual Basic
Public Shared Function IsValidCategoryId ( _
	categoryId As ElementId, _
	doc As Document _
) As Boolean
Visual C++
public:
static bool IsValidCategoryId(
	ElementId^ categoryId,
	Document^ doc
)
Parameters
categoryId
Type: Autodesk.Revit.DB.ElementId
 Category id to be tested.
doc
Type: Autodesk.Revit.DB.Document
 Document to look up the category by id.
Return Value
 False unless categoryId corresponds to a valid built-in top-level model category.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
DirectShape Class
Autodesk.Revit.DB Namespace